{
  "name": "BaoLianDeng",
  "subtitle": "iOS VPN proxy app powered by Mihomo (Clash Meta)",
  "description": "BaoLianDeng is an open-source iOS VPN proxy app powered by the Mihomo (Clash Meta) core. It features subscription management, visual config editing, traffic analytics, and aggressive memory management for iOS's network extension limits.\n\nSource code: https://github.com/madeye/BaoLianDeng",
  "iconURL": "https://raw.githubusercontent.com/madeye/BaoLianDeng/main/BaoLianDeng/Assets.xcassets/AppIcon.appiconset/AppIcon.png",
  "website": "https://github.com/madeye/BaoLianDeng",
  "tintColor": "#007AFF",
  "apps": [
    {
      "name": "BaoLianDeng",
      "bundleIdentifier": "io.github.baoliandeng",
      "developerName": "Max Lv",
      "subtitle": "Mihomo (Clash Meta) VPN proxy for iOS",
      "localizedDescription": "BaoLianDeng is an iOS VPN proxy app powered by the Mihomo (Clash Meta) core.\n\nFeatures:\n- Subscription Management: Add, edit, refresh, and switch between proxy subscriptions (Clash YAML and base64 formats)\n- Visual Config Editor: Edit proxy groups and rules as interactive lists instead of raw YAML\n- Proxy Node Selection: Browse nodes by subscription with protocol icons and latency indicators\n- Traffic Analytics: Daily bar charts, session stats, and monthly summaries\n- Proxy Groups: View and switch proxy groups via Mihomo's REST API\n- Tunnel Logs: Real-time log viewer for debugging\n- Aggressive Memory Management: Go runtime tuned for iOS's ~15 MB network extension limit",
      "iconURL": "https://raw.githubusercontent.com/madeye/BaoLianDeng/main/BaoLianDeng/Assets.xcassets/AppIcon.appiconset/AppIcon.png",
      "tintColor": "#007AFF",
      "category": "utilities",
      "versions": [
        {
          "version": "2.0",
          "buildVersion": "1",
          "date": "2026-02-23",
          "localizedDescription": "- Visual Config Editor: Proxy groups and rules displayed as interactive lists (add, delete, reorder) instead of raw YAML\n- Collapsible Subscriptions: Tap subscription headers to expand/collapse node lists\n- Flow Mapping Parser Fix: Subscriptions using inline YAML format now parse correctly\n- Auto Re-parse: Subscriptions with raw content but missing nodes are automatically re-parsed on launch",
          "downloadURL": "https://github.com/madeye/BaoLianDeng/releases/download/v2.0/BaoLianDeng.ipa",
          "size": 12559199,
          "minOSVersion": "17.0"
        }
      ],
      "appPermissions": {
        "entitlements": [
          "com.apple.developer.networking.networkextension",
          "com.apple.security.application-groups",
          "keychain-access-groups"
        ],
        "privacy": {}
      }
    }
  ],
  "news": []
}
